sendDocument.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://api.echosign" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://dto.api.echosign">
	<SOAP-ENV:Body>
		<ns1:sendDocument>
			<ns1:apiKey>P6H4S54GT4445U</ns1:apiKey>
			<ns1:senderInfo xsi:nil="true" />
			<ns1:documentCreationInfo>
				<ns2:fileInfos>
					<ns2:FileInfo>
						<ns2:file>{file}</ns2:file>
						<ns2:fileName>test.pdf</ns2:fileName>
					</ns2:FileInfo>
				</ns2:fileInfos>
				<ns2:message>This is neat.</ns2:message>
				<ns2:name>Test from SOAP-Lite: test.pdf</ns2:name>
				<ns2:signatureFlow>SENDER_SIGNATURE_NOT_REQUIRED</ns2:signatureFlow>
				<ns2:signatureType>ESIGN</ns2:signatureType>
				<ns2:tos>
					<ns1:string>testsign@adambreen.com</ns1:string>
				</ns2:tos>
				<ns1:CallbackInfo><ns2:signedDocumentUrl>http://adam.sleipnerfinancial.com.au/</ns2:signedDocumentUrl></ns1:CallbackInfo>
			</ns1:documentCreationInfo>
		</ns1:sendDocument>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>